chipKIT32/chipKIT-core/pic32/cores/pic32/wiring_analog.c
#elif defined(__PIC32MZEFADC__)
    analogValue	=	convertWiFIREadcEFConversion();
#else
    #error ADC code for this MZ must be added in WSystems.c and wiring_analog.c
#endif

#else
	// Read the ADC Value
	analogValue	=	ADC1BUF0;
#endif

	return (analogValue);
}

int _analogRead(uint8_t pin)
{
  _analogReadConversionStart(pin);
  while( ! _analogReadConversionComplete() );
  return _analogReadConversion();
}

//*********************************************************************
//*	PWM output only works on the pins with hardware support. 
//*	These are defined in the appropriate pins_*.c file.
//*	For the rest of the pins, we default to digital output.
//*********************************************************************
//*	Gene Apperson Aug 2011
//*	analogWrite resets timer 2 each time it is called. 
//*	This causes the PWM to fail if it is called repeatedly with a short interval between calls.
//*	This is the suggested fixed version of analogWrite.
//*********************************************************************
void analogWrite(uint8_t pin, int val)
{
	uint16_t	timer;
	uint16_t	pwm_mask;
	p32_oc *	ocp;

	/* Check if pin number is in valid range.
	*/
	if (pin >= NUM_DIGITAL_PINS_EXTENDED)
	{
		return;
	}

#if (OPT_BOARD_ANALOG_WRITE != 0)
	/* Perform any board specific processing.
	*/
int	_board_analogWrite(uint8_t pin, int val);

	if (_board_analogWrite(pin, val) != 0)
	{
		return;
	}
#endif		// OPT_BOARD_ANALOG_WRITE

	/* Determine if this is actually a PWM capable pin or not.
	** The value in timer will be the output compare number associated with
	** the pin, or NOT_ON_TIMER if no OC is connected to the pin.
	** The values 0 or >=255 have the side effect of turning off PWM on
	** pins that are PWM capable.
	*/
	timer = digitalPinToTimerOC(pin) >> _BN_TIMER_OC;

	if ((timer == NOT_ON_TIMER) || (val == 0) || (val >= ((1 << _pwmResolution) - 1)))
	{
            /* We're going to be setting the pin to a steady state.
            ** Make sure it is set as a digital output. And then set
            ** it LOW or HIGH depending on the value requested to be
            ** written. The digitalWrite function has the side effect
            ** of turning off PWM on the pin if it happens to be a
            ** PWM capable pin.
            */
            pinMode(pin, OUTPUT);

	    if (val < ((1 << _pwmResolution) / 2))
	    {
	        digitalWrite(pin, LOW);
	    }
	    else
	    {
	        digitalWrite(pin, HIGH);
	    }
	}

	else
	{
            /* It's a PWM capable pin. Timer 2 is used for the time base
            ** for analog output, so if no PWM are currently active then
            ** Timer 2 needs to be initialized
            */
            if (pwm_active == 0)
            {
                configurePWM();
            }

            /* Generate bit mask for this output compare.
            */
            pwm_mask = (1 << (timer - (_TIMER_OC1 >> _BN_TIMER_OC)));

            /* Obtain a pointer to the output compare being being used
            ** NOTE: as of 11/15/2011 All existing PIC32 devices
            ** (PIC32MX1XX/2XX/3XX/4XX/5XX/6XX/7XX) have the output compares
            ** in consecutive locations. The base address is _OCMP1_BASE_ADDRESS
            ** and the distance between their addresses is 0x200.
            */
            ocp = (p32_oc *)(_OCMP1_BASE_ADDRESS + (0x200 * (timer - (_TIMER_OC1 >> _BN_TIMER_OC))));

            /* If the requested PWM isn't active, init its output compare. Enabling
            ** the output compare takes over control of pin direction and forces the
            ** pin to be an output.
            */
            if ((pwm_active & pwm_mask) == 0)
            {

#if defined(__PIC32_PPS__)
                volatile uint32_t *	pps;

                /* On devices with peripheral pin select, it is necessary to connect
                ** the output compare to the pin.
                */
                pps = ppsOutputRegister(pin);
                *pps = ppsOutputSelect(timerOCtoOutputSelect(timer));
#endif
                ocp->ocxR.reg   = (_pwmPeriod * val) / (1 << _pwmResolution) ;
                ocp->ocxCon.reg = OCCON_SRC_TIMER2 | OCCON_PWM_FAULT_DISABLE;
                ocp->ocxCon.set = OCCON_ON;

                pwm_active |= pwm_mask;
            }

            /* Set the duty cycle register for the requested output compare
            */
            ocp->ocxRs.reg = (_pwmPeriod * val) / (1 << _pwmResolution);
        }
}


//************************************************************************
void turnOffPWM(uint8_t timer)
{
	p32_oc *	ocp;
    uint16_t	pwm_mask = (1 << (timer - (_TIMER_OC1 >> _BN_TIMER_OC)));

    // only process this if the PWM was ON
    if((pwm_active & pwm_mask) != 0)
    {
        /* Disable the output compare.
        */
        ocp = (p32_oc *)(_OCMP1_BASE_ADDRESS + (0x200 * (timer - (_TIMER_OC1 >> _BN_TIMER_OC))));
        ocp->ocxCon.clr = OCCON_ON;

        // Turn off the bit saying that this PWM is active.
        pwm_active &= ~pwm_mask;

        // If no PWM are active, turn off the timer.
        if (pwm_active == 0)
        {
            T2CONbits.ON = 0;
        }
    }
}

static const psval[8] = {1, 2, 4, 6, 16, 32, 64, 256};


static void configurePWM() {
    T2CONbits.ON = 0; // turn off while we make adjustments
#if defined(__PIC32MZXX__)
    CFGCONbits.OCACLK = 0;
#endif

    uint32_t res = (1 << _pwmResolution);

    uint32_t baseClock = getPeripheralClock();

    uint32_t ps = 0;

    for (ps = 0; ps < 8; ps++) {
        _pwmPeriod = (baseClock / psval[ps]) / (_pwmFrequency);
        if (_pwmPeriod <= 0xFFFF) {
            break;
        }
    }

    if (_pwmPeriod > 0xFFFF) { // Impossible to make this work!
        _pwmPeriod = 0xFFFF;
        ps = 7;
    }

    T2CONbits.TCKPS = ps;
    TMR2 = 0;
    PR2 = _pwmPeriod;
    T2CONbits.ON = 1;
}

