chipKIT32/chipKIT-core/pic32/cores/pic32/wiring_analog.c
// This macro will take the existing value from the OCRS register, back-calculate
// what the supplied value to analogWrite() was, re-scale it to fit the new
// period and resolution, and re-apply it to OCRS. This should keep the duty
// cycle the same no matter what you do with the frequency and the resolution
// on a live system.

#define FIX_PWM(OC) OC = OC * (1 << oldResolution) / oldPeriod * (1 << _pwmResolution) / (1 << oldResolution) * _pwmPeriod / (1 << _pwmResolution);


void analogWriteFrequency(uint32_t f) {
    uint32_t oldPeriod = _pwmPeriod;
    uint32_t oldResolution = _pwmResolution;
    _pwmFrequency = f;

    if (pwm_active) {

        configurePWM();

#ifdef _OCMP1_BASE_ADDRESS
        FIX_PWM(OC1RS)
#endif
            
#ifdef _OCMP2_BASE_ADDRESS
        FIX_PWM(OC2RS)
#endif
            
#ifdef _OCMP3_BASE_ADDRESS
        FIX_PWM(OC3RS)
#endif
            
#ifdef _OCMP4_BASE_ADDRESS
        FIX_PWM(OC4RS)
#endif
            
#ifdef _OCMP5_BASE_ADDRESS
        FIX_PWM(OC5RS)
#endif
            
#ifdef _OCMP6_BASE_ADDRESS
        FIX_PWM(OC6RS)
#endif
            
#ifdef _OCMP7_BASE_ADDRESS
        FIX_PWM(OC7RS)
#endif
            
#ifdef _OCMP8_BASE_ADDRESS
        FIX_PWM(OC8RS)
#endif
            
#ifdef _OCMP9_BASE_ADDRESS
        FIX_PWM(OC9RS)
#endif
            
    }
}

void analogWriteResolution(uint8_t r) {
    uint32_t oldPeriod = _pwmPeriod;
    uint32_t oldResolution = _pwmResolution;
    _pwmResolution = min(r, 16);
    if (pwm_active) {
        configurePWM();

#ifdef _OCMP1_BASE_ADDRESS
        FIX_PWM(OC1RS)
#endif
            
#ifdef _OCMP2_BASE_ADDRESS
        FIX_PWM(OC2RS)
#endif
            
#ifdef _OCMP3_BASE_ADDRESS
        FIX_PWM(OC3RS)
#endif
            
#ifdef _OCMP4_BASE_ADDRESS
        FIX_PWM(OC4RS)
#endif
            
#ifdef _OCMP5_BASE_ADDRESS
        FIX_PWM(OC5RS)
#endif
            
#ifdef _OCMP6_BASE_ADDRESS
        FIX_PWM(OC6RS)
#endif
            
#ifdef _OCMP7_BASE_ADDRESS
        FIX_PWM(OC7RS)
#endif
            
#ifdef _OCMP8_BASE_ADDRESS
        FIX_PWM(OC8RS)
#endif
            
#ifdef _OCMP9_BASE_ADDRESS
        FIX_PWM(OC9RS)
#endif
    }
}
